# RibbonButtonOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonButtonOptions Class
Members See Also
---
A utility class containing the Revit.ini options settings related to ribbon buttons
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public class RibbonButtonOptions : IDisposable
```

Visual Basic
---
```text
Public Class RibbonButtonOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RibbonButtonOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..RibbonButtonOptions
# See Also
RibbonButtonOptions Members
Autodesk.Revit.UI Namespace